---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile2Angle
source: html/d70e0d26-f96c-9159-7177-cd7eb9aed5dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile2Angle Property

"Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile2Angle { get; }
```